Repository: ilayloww/coupleBalance
Catalog: lib/l10n/app_*.arb
Languages: tr

source: Welcome Back!
tr: Tekrar Hoşgeldin!

source: Create Account
tr: Hesap Oluştur

# trackExpensesTogether
source: Track expenses together <3
tr: Harcamaları birlikte takip edin <3

source: Email
tr: E-posta

source: Password
tr: Şifre

source: Login
tr: Giriş Yap

source: Sign Up
tr: Kayıt Ol

# dontHaveAccount
source: Don't have an account? Sign Up
tr: Hesabın yok mu? Kayıt Ol

# alreadyHaveAccount
source: Already have an account? Login
tr: Zaten hesabın var mı? Giriş Yap

# authFailed
source: Authentication failed
tr: Kimlik doğrulama başarısız

# unexpectedError
source: An unexpected error occurred
tr: Beklenmeyen bir hata oluştu

# enterEmail
source: Please enter your email
tr: Lütfen e-posta adresinizi girin

# tooManyRequests
source: Too many attempts. Please try again later.
tr: Çok fazla deneme yaptınız. Lütfen daha sonra tekrar deneyin.

# validEmail
source: Please enter a valid email
tr: Lütfen geçerli bir e-posta girin

# enterPassword
source: Please enter your password
tr: Lütfen şifrenizi girin

# passwordMinLength
source: Password must be at least 6 characters
tr: Şifre en az 6 karakter olmalıdır

source: Recent Transactions
tr: Son İşlemler

# pleaseLinkPartnerFirst
source: Please link a partner first
tr: Lütfen önce bir partner bağlayın

source: No Partner Linked
tr: Partner Bağlı Değil

source: Link Partner
tr: Partner Bağla

source: Partner owes you
tr: Partner sana borçlu

source: You owe Partner
tr: Partnerine borçlusun

# settlementInDays
source: Settlement in {days} days
tr: Hesap kesimine {days} gün

source: Settle Up
tr: Hesaplaş

source: History
tr: Geçmiş

# settleUpTitle
source: Settle Up?
tr: Hesaplaşılsın mı?

# settleUpContent
source: This will archive all current transactions and reset the balance to 0. Amount: {amount} {currency} {payerInfo}
tr: Bu işlem mevcut tüm harcamaları arşivleyecek ve bakiyeyi sıfırlayacaktır. Tutar: {amount} {currency} {payerInfo}

source: You are paying
tr: Ödemeyi sen yapıyorsun

source: Partner is paying
tr: Ödemeyi partnerin yapıyor

source: Cancel
tr: İptal

source: Confirm
tr: Onayla

# settlementComplete
source: Settlement complete! Balance reset.
tr: Hesaplaşma tamamlandı! Bakiye sıfırlandı.

source: Select Settlement Day
tr: Hesap Kesim Gününü Seç

# day
source: Day {day}
tr: {day}. Gün

source: No transactions yet.
tr: Henüz işlem yok.

# deleteTransactionTitle
source: Delete Transaction?
tr: İşlemi Sil

# deleteTransactionContent
source: Are you sure you want to delete this item?
tr: Bu öğeyi silmek istediğinizden emin misiniz?

source: Delete
tr: Sil

source: Add Expense
tr: Harcama Ekle

# amount
source: Amount ({currency})
tr: Tutar ({currency})

# youPaidSplit
source: You paid, split equally
tr: Sen ödedin, eşit bölüş

# youPaidFull
source: You are owed full amount
tr: Tamamını sen geri alacaksın

# partnerPaidSplit
source: {partnerName} paid, split equally
tr: {partnerName} ödedi, eşit bölüş

# partnerPaidFull
source: {partnerName} is owed full amount
tr: Tamamını {partnerName} geri alacak

source: What is it for?
tr: Ne için?

# expenseHint
source: e.g. Dinner, Rent
tr: Örn. Akşam Yemeği, Kira

# tagFood
source: Food
tr: Yemek

# tagCoffee
source: Coffee
tr: Kahve

# tagGroceries
source: Groceries
tr: Market

# tagRent
source: Rent
tr: Kira

# tagTransport
source: Transport
tr: Ulaşım

# tagBills
source: Bills
tr: Faturalar

# tagShopping
source: Shopping
tr: Alışveriş

source: Add Receipt / Photo
tr: Fiş / Fotoğraf Ekle

source: Image selected
tr: Görsel seçildi

# validAmountError
source: Please enter a valid amount
tr: Lütfen geçerli bir tutar girin

source: Gallery
tr: Galeri

source: Camera
tr: Kamera

source: Profile picture updated!
tr: Profil fotoğrafı güncellendi!

# uploadError
source: Error uploading image: {error}
tr: Görsel yükleme hatası: {error}

# profileUpdated
source: Profile updated successfully
tr: Profil başarıyla güncellendi

source: My Profile
tr: Profilim

source: Display Name
tr: Görünen Ad

source: Appearance
tr: Görünüm

source: System
tr: Sistem

source: Light
tr: Açık

source: Dark
tr: Koyu

source: Save Profile
tr: Profili Kaydet

source: Logout
tr: Çıkış Yap

source: Language
tr: Dil

source: English
tr: İngilizce

source: Turkish
tr: Türkçe

source: Details
tr: Detaylar

source: No receipt photo
tr: Fiş fotoğrafı yok

source: You paid
tr: Sen ödedin

source: Partner paid
tr: Partner ödedi

source: Date
tr: Tarih

source: Status
tr: Durum

source: Settled
tr: Ödendi

source: Unsettled
tr: Ödenmedi

# linkPartnerTitle
source: Link Partner
tr: Partner Bağla

# contactSelected
source: Selected {name}: {email}.
tr: Seçilen {name}: {email}.

# noEmailContact
source: Selected contact has no email address.
tr: Seçilen kişinin e-posta adresi yok.

# contactPickError
source: Error picking contact: {error}
tr: Kişi seçme hatası: {error}

# permissionDenied
source: Permission denied. Cannot access contacts.
tr: İzin reddedildi. Kişilere erişilemiyor.

# partnerNotFound
source: Partner User not found with this email. Ask them to login once.
tr: Bu e-posta ile partner bulunamadı. Lütfen bir kez giriş yapmalarını söyleyin.

# cannotLinkSelf
source: You cannot link with yourself.
tr: Kendini partner olarak ekleyemezsin.

# linkPartnerInstruction
source: Enter your partner's Email Address to link accounts. Make sure they have updated their app and logged in at least once.
tr: Hesapları bağlamak için partnerinin E-posta adresini gir. Uygulamayı güncellediklerinden ve en az bir kez giriş yaptıklarından emin ol.

source: Partner Email
tr: Partner E-posta

# pickFromContacts
source: Pick from Contacts (Simulation)
tr: Rehberden Seç (Simülasyon)

# unlinkPartnerTitle
source: Unlink Partner?
tr: Bağlantıyı Kes?

# unlinkWarning
source: Are you sure you want to unlink? You will no longer see shared expenses.
tr: Bağlantıyı kesmek istediğine emin misin? Artık ortak harcamaları göremeyeceksin.

source: Unlink
tr: Bağlantıyı Kes

# unlinkedSuccess
source: Unlinked successfully
tr: Bağlantı başarıyla kesildi

# unlinkError
source: Error unlinking: {error}
tr: Bağlantı kesme hatası: {error}

source: Partner Profile
tr: Partner Profili

source: Partner data not found
tr: Partner verisi bulunamadı

source: No Email
tr: E-posta Yok

source: Settlement History
tr: Hesaplaşma Geçmişi

source: Error loading history
tr: Geçmiş yüklenirken hata

source: No past settlements
tr: Geçmiş hesaplaşma yok

source: You paid Partner
tr: Sen Partnerine ödedin

source: Partner paid You
tr: Partnerin sana ödedi

# transactionCount
source: {count} transactions
tr: {count} işlem

source: More options...
tr: Diğer seçenekler...

source: Who paid?
tr: Kim ödedi?

source: How to split?
tr: Nasıl bölünecek?

source: Custom Amount
tr: Özel Tutar

source: Me
tr: Ben

# splitEqually
source: Equally
tr: Eşit

source: Full Amount
tr: Tamamı

source: Custom
tr: Özel

source: Enter amount owed
tr: Borçlanılan tutarı girin

source: Split by
tr: Bölüşüm Tipi

# byAmount
source: Amount
tr: Tutar

# byPercentage
source: Percentage
tr: Yüzde

source: Enter percentage
tr: Yüzde girin

source: Percentage
tr: Yüzde

source: Theme Color
tr: Tema Rengi

# partnerAlreadyLinked
source: Partner already linked ({partnerInfo})
tr: Partner zaten bağlı ({name})

# partnersTitle
source: Partners
tr: Partnerler

# unlinkPartnerContent
source: Are you sure you want to unlink {name}?
tr: {name} ile bağlantıyı kesmek istediğine emin misin?

source: No partners linked yet.
tr: Henüz bağlı partner yok.

source: Email Verification
tr: E-posta Doğrulama

# verifyEmailMessage
source: Please verify your email address. A verification link has been sent to {email}.
tr: Lütfen e-posta adresinizi doğrulayın. {email} adresine bir doğrulama bağlantısı gönderildi.

source: Resend Verification Email
tr: Doğrulama E-postasını Tekrar Gönder

source: I have verified
tr: Doğruladım

# emailVerifiedSuccess
source: Email verified successfully!
tr: E-posta başarıyla doğrulandı!

source: Email not verified yet.
tr: E-posta henüz doğrulanmadı.

source: Verification email sent!
tr: Doğrulama e-postası gönderildi!

# checkSpamFolder
source: Please also check your spam folder.
tr: Lütfen spam klasörünüzü de kontrol edin.

source: Forgot Password?
tr: Şifremi Unuttum?

source: Reset Password
tr: Şifre Sıfırla

# enterEmailToReset
source: Enter your email to reset password
tr: Şifrenizi sıfırlamak için e-postanızı girin

source: Send Reset Link
tr: Sıfırlama Bağlantısı Gönder

# resetEmailSent
source: Password reset email sent!
tr: Şifre sıfırlama e-postası gönderildi!

source: Change Password
tr: Şifre Değiştir

source: Current Password
tr: Mevcut Şifre

source: New Password
tr: Yeni Şifre

source: Confirm New Password
tr: Yeni Şifre (Tekrar)

# passwordUpdated
source: Password updated successfully
tr: Şifre başarıyla güncellendi

source: Passwords do not match
tr: Şifreler eşleşmiyor

# invalidEmail
source: Please enter a valid email
tr: Lütfen geçerli bir e-posta girin

source: Error
tr: Hata

# incorrectPassword
source: Incorrect password entered
tr: Girdiğiniz şifre yanlış

# weakPassword
source: Password is too weak
tr: Şifre çok zayıf

# reauthRequired
source: Please log in again to change password
tr: Şifrenizi değiştirmek için lütfen tekrar giriş yapın

# userNotFound
source: No account found with this email
tr: Bu e-posta ile kayıtlı hesap bulunamadı

# emailAlreadyInUse
source: Email is already registered
tr: Bu e-posta zaten kullanımda

# invalidCredential
source: Incorrect email or password
tr: E-posta veya şifre hatalı

# networkRequestFailed
source: Network error. Please check your connection.
tr: Ağ hatası. Lütfen bağlantınızı kontrol edin.

source: Remove Account
tr: Hesabımı Sil

# deleteAccountTitle
source: Delete Account
tr: Hesabı Sil

# deleteAccountWarning
source: This action is irreversible. All your data including transactions, settlements, and profile information will be permanently deleted.
tr: Bu işlem geri alınamaz. İşlemler, hesaplaşmalar ve profil bilgileri dahil tüm verileriniz kalıcı olarak silinecektir.

# enterEmailToConfirm
source: Enter your email to confirm
tr: Onaylamak için e-postanızı girin

source: Delete Forever
tr: Kalıcı Olarak Sil

# accountDeleted
source: Account deleted successfully.
tr: Hesap başarıyla silindi.

# requestNotFound
source: Request not found or timed out.
tr: İstek bulunamadı veya zaman aşımına uğradı.

source: Partner wants to settle up
tr: Partnerin hesaplaşmak istiyor

# settlementConfirmationDescription
source: Confirming this will clear selected transactions and update your balance.
tr: Onayladığında seçilen işlemler temizlenecek ve bakiyen güncellenecektir.

source: Go Home
tr: Ana Sayfa

# requestSentSuccess
source: Request sent successfully! Waiting for confirmation...
tr: İstek gönderildi! Onay bekleniyor...

# pendingRequestExists
source: A pending request already exists. Please wait for your partner to respond.
tr: Bekleyen bir istek zaten var. Lütfen partnerinin yanıt vermesini bekle.

# requestSendFailed
source: Failed to send request. Please try again.
tr: İstek gönderilemedi. Lütfen tekrar dene.

source: Send Request
tr: İstek Gönder

source: Pending Settlements
tr: Bekleyen Hesaplaşmalar

source: requests waiting
tr: istek bekliyor

source: Waiting for...
tr: Bekleniyor...

# settlementRequestTitle
source: Settlement Request
tr: Hesaplaşma İsteği

source: Reject
tr: Reddet

# sendRequestDialogContent
source: This will send a request to your partner to confirm the settlement of {amount} {currency}.
tr: Bu işlem, partnerine {amount} {currency} tutarındaki hesaplaşmayı onaylaması için bir istek gönderecektir.

# noTransactionsToday
source: No transactions for this day
tr: Bugün için işlem yok

source: Settlement confirmed!
tr: Hesaplaşma onaylandı!

source: Settlement rejected.
tr: Hesaplaşma reddedildi.

# genericError
source: An error occurred. Please try again.
tr: Bir hata oluştu. Lütfen tekrar deneyin.

# requestAlreadyStatus
source: This request is already {status}.
tr: Bu istek zaten {status}.

# settleSingleTransactionTitle
source: Settle Transaction
tr: İşlemi Öde

# settleSingleTransactionContent
source: Do you want to accept the settlement for '{note}'?
tr: '{note}' işlemi için hesaplaşmayı onaylıyor musun?

source: Good Morning
tr: Günaydın

source: Good Afternoon
tr: Tünaydın

source: Good Evening
tr: İyi Akşamlar

source: Good Night
tr: İyi Geceler

source: Settings
tr: Ayarlar

source: Notifications
tr: Bildirimler

# editProfile
source: Edit
tr: Düzenle

source: Done
tr: Tamam

# passwordMinLength8
source: Must contain at least 8 characters
tr: En az 8 karakter içermeli

source: Update Password
tr: Şifreyi Güncelle

# passwordDifferentNote
source: Your new password must be different from previous used passwords
tr: Yeni şifreniz öncekilerden farklı olmalı

source: Enter current password
tr: Mevcut şifreyi girin

source: Enter new password
tr: Yeni şifreyi girin

source: Re-enter new password
tr: Yeni şifreyi tekrar girin

# passwordCannotBeSame
source: New password cannot be the same as current password
tr: Yeni şifre mevcut şifre ile aynı olamaz
